{
    "recipes": [
        {
            "id": 1,
            "name": "Chocolate Chip Cookies",
            "lower_name": "chocolate chip cookies",
            "ingredients": [
                "1 cup butter, softened",
                "1 cup white sugar",
                "1 cup packed brown sugar",
                "2 eggs",
                "2 teaspoons vanilla extract",
                "1 teaspoon baking soda",
                "2 teaspoons hot water",
                "1/2 teaspoon salt",
                "3 cups all-purpose flour",
                "2 cups semisweet chocolate chips",
                "1 cup chopped walnuts"
            ],
            "steps": "Gather your ingredients making sure your butter is softened and your eggs are room temperature. Preheat the oven to 350 degrees F (175 degrees C). Beat butter white sugar and brown sugar with an electric mixer in a large bowl until smooth. Beat in eggs one at a time then stir in vanilla. Dissolve baking soda in hot water. Add to batter along with salt. Stir in flour chocolate chips and walnuts. Drop spoonfuls of dough 2 inches apart onto ungreased baking sheets. Bake in the preheated oven until edges are nicely browned about 10 minutes. Cool on the baking sheets briefly before removing to a wire rack to cool completely. Store in an airtight container or serve immediately and enjoy!"
        },
        {
            "id": 2,
            "name": "Cheesecake",
            "lower_name": "cheesecake",
            "ingredients": [
                "1 1/2 cups graham cracker crumbs",
                "1 cup & 2 tablespoons sugar",
                "1 tablespoon brown sugar",
                "7 tablespoons of melted butter",
                "32 oz cream cheese",
                "2/3 cups sour cream",
                "1 1/2 teaspoons vanilla extract",
                "1/8 teaspoon salt",
                "4 eggs"
            ],
            "steps": "Preheat oven to 325F (160C). Prepare Graham Cracker crust first by combining graham cracker crumbs, sugar, and brown sugar, and stirring well. Add melted butter and use a fork to combine ingredients well. Pour crumbs into a 9 inch Springform pan and press firmly into the bottom and up the sides of your pan. Set aside. In the bowl of a stand mixer or in a large bowl (using a hand mixer) add cream cheese and stir until smooth and creamy (don’t over-beat or you’ll incorporate too much air). Add sugar and stir again until creamy. Add sour cream, vanilla extract, and salt, and stir until well-combined. If using a stand mixer, make sure you pause periodically to scrape the sides and bottom of the bowl with a spatula so that all ingredients are evenly incorporated. With mixer on low speed, gradually add lightly beaten eggs, one at a time, stirring just until each egg is just incorporated. Once all eggs have been added, use a spatula to scrape the sides and bottom of the bowl again and make sure all ingredients are well combined. Pour cheesecake batter into prepared springform pan. To insure against leaks, place pan on a cookie sheet that’s been lined with foil. Transfer to the center rack of your oven and bake on 325F (160C) for about 75 minutes. Edges will likely have slightly puffed and may have just begun to turn a light golden brown and the center should spring back to the touch but will still be Jello-jiggly. Don't over-bake or the texture will suffer, which means we all suffer. Remove from oven and allow to cool on top of the oven³ for 10 minutes. Once 10 minutes has passed, use a knife to gently loosen the crust from the inside of the springform pan (this will help prevent cracks as your cheesecake cools and shrinks). Do not remove the ring of the springform pan. Allow cheesecake to cool another 1-2 hours or until near room temperature before transferring to refrigerator and allowing to cool overnight or at least 6 hours. I remove the ring of the springform pan just before serving then return it to the pan to store. Enjoy!"
        }
    ]
}
